<?php
// 4. Объявить массив, индексами которого являются буквы русского языка, а значениями – соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).
//Написать функцию транслитерации строк.
/**
 * @param $textInArray | Переданная строка распарсенная по букве в массив
 * @param $alphabet | транслитный словарик ключ "русская буква" => значение "буква латинице"
 * @return string
 */

$alphabet = [
    "А"=>"A","Б"=>"B","В"=>"V","Г"=>"G",
    "Д"=>"D","Е"=>"E","Ё"=>"E","Ж"=>"J","З"=>"Z","И"=>"I",
    "Й"=>"Y","К"=>"K","Л"=>"L","М"=>"M","Н"=>"N",
    "О"=>"O","П"=>"P","Р"=>"R","С"=>"S","Т"=>"T",
    "У"=>"U","Ф"=>"F","Х"=>"H","Ц"=>"TS","Ч"=>"CH",
    "Ш"=>"SH","Щ"=>"SCH","Ъ"=>"","Ы"=>"YI","Ь"=>"",
    "Э"=>"E","Ю"=>"YU","Я"=>"YA","а"=>"a","б"=>"b",
    "в"=>"v","г"=>"g","д"=>"d","е"=>"e","ё"=>"e","ж"=>"j",
    "з"=>"z","и"=>"i","й"=>"y","к"=>"k","л"=>"l",
    "м"=>"m","н"=>"n","о"=>"o","п"=>"p","р"=>"r",
    "с"=>"s","т"=>"t","у"=>"u","ф"=>"f","х"=>"h",
    "ц"=>"ts","ч"=>"ch","ш"=>"sh","щ"=>"sch","ъ"=>"y",
    "ы"=>"yi","ь"=>"'","э"=>"e","ю"=>"yu","я"=>"ya",
    ","=>",", " "=>" "
];

// Первый вариант
function transliteWords($textInArray, $alphabet): string
{
    echo 'Первый вариант :<br>';
    $finalString = '';
    foreach ($textInArray as $value){
        if (array_key_exists($value, $alphabet)){
            $finalString .= $alphabet[$value];
        } else {
            $finalString .= $value;
        }
    }
    return $finalString;
}

$str = "Субъект Российской Федерации или сокращённо субъект Федерации, субъект России, субъект РФ — название территориальной единицы верхнего уровня в Российской Федерации. ";
$strPreg  =  preg_split('//u', $str, -1, PREG_SPLIT_NO_EMPTY);
echo 'Начальная строка: ' . '<br>' . $str . '<br><br>';
echo (transliteWords($strPreg, $alphabet));
echo '<br>';

// Второй вариант
function translitWords($text,$alphabet): string
{
    echo 'Второй вариант :<br>';
    return strtr($text, $alphabet);
}
echo (translitWords($str, $alphabet));

